Revit 2024 API
MEPSpaceConstruction Class
Construction definition for Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class MEPSpaceConstruction
Visual Basic
Public Class MEPSpaceConstruction
Visual C++
public ref class MEPSpaceConstruction
Remarks
This is used to define the information in Constructions.xml.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction
See Also
MEPSpaceConstruction Members
Autodesk.Revit.DB.Mechanical Namespace